erp3l/src/DataProcessors/ГенерацияМоделиОтчетностиКИК/ГенерацияМоделиОтчетностиКИК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ГенерацияМоделиОтчетностиКИК</name>
</mdclass:DataProcessor>

erp3l/src/Enums/СпособыФормированияОтчетов/СпособыФормированияОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыФормированияОтчетов</name>
  <enumValues>
    <name>РучноеЗаполнение</name>
  </enumValues>
  <enumValues>
    <name>Импорт</name>
  </enumValues>
  <enumValues>
    <name>АвтоматическиПоПравилуОбработки</name>
  </enumValues>
  <enumValues>
    <name>АвтоматическиСвернувПоАналитикам</name>
  </enumValues>
  <enumValues>
    <name>АвтоматическиКонсолидация</name>
  </enumValues>
  <enumValues>
    <name>АвтоматическиСвернувПоПериоду</name>
  </enumValues>
  <enumValues>
    <name>ИмпортФНС</name>
  </enumValues>
  <enumValues>
    <name>АвтоматическиСвернувПоПроектам</name>
  </enumValues>
  <enumValues>
    <name>АвтоматическиСвернувПоОрганизациямПроекта</name>
  </enumValues>
  <enumValues>
    <name>АвтоматическиЭлиминация</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Enums/ЭлементыНастройкиОтчета/ЭлементыНастройкиОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭлементыНастройкиОтчета</name>
  <enumValues>
    <name>ПравилоОбработки</name>
  </enumValues>
  <enumValues>
    <name>ПакетПравилИмпорта</name>
  </enumValues>
  <enumValues>
    <name>ПравилоПроверки</name>
  </enumValues>
  <enumValues>
    <name>БланкДляОтображения</name>
  </enumValues>
  <enumValues>
    <name>БланкДляИмпорта</name>
  </enumValues>
  <enumValues>
    <name>ВнешняяИнформационнаяБаза</name>
  </enumValues>
  <enumValues>
    <name>Периодичность</name>
  </enumValues>
  <enumValues>
    <name>СпособФормированияОтчета</name>
  </enumValues>
  <enumValues>
    <name>ПравилоИмпортаОбъекта</name>
  </enumValues>
  <enumValues>
    <name>ШаблонТрансляции</name>
  </enumValues>
  <enumValues>
    <name>БланкСводнойТаблицы</name>
  </enumValues>
  <enumValues>
    <name>БланкДляОтображенияМногопериодный</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Catalogs/ТипыБазДанных/ТипыБазДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыБазДанных</name>
  <predefined>
    <items>
      <name>ОбменТаблДок</name>
      <description>Табличные документы (1С или Microsoft Excel)</description>
    </items>
    <items>
      <name>ТекущаяИБ</name>
      <description>Текущая информационная база</description>
    </items>
  </predefined>
  <attributes>
    <name>ВИБПоУмолчанию</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>EnumRef.ПлатформыВнешнихИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПоУмолчанию</name>
    <comment>Если при сопоставлении получено пустое значение валюты, тогда подставить значение валюты по умолчанию</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеВидовСубконто</name>
    <attributes>
      <name>ВидСубконтоИБ</name>
      <type>
        <types>ChartOfCharacteristicTypesRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидАналитики</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/ВнешниеИнформационныеБазы/ВнешниеИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВнешниеИнформационныеБазы</name>
  <predefined>
    <items>
      <name>ТекущаяИБ</name>
      <description>Текущая информационная база</description>
    </items>
  </predefined>
  <attributes>
    <name>URIПространстваИмен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АутентификацияWindows</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперацииСФайлами</name>
    <type>
      <types>EnumRef.ВидыОперацийСФайлами</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяWebСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяИБНаСервере</name>
    <comment>Имя информационной базы на сервере</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервера</name>
    <comment>Имя сервера 1С: Предприятия</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьWS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаскаПолногоИмени</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаИмпортаФайлаФорматаФНС</name>
    <type>
      <types>CatalogRef.НастройкиИмпортаФайлаИзФНС</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоИмени</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НСИ_ТребуетСинхронизации</name>
    <comment>(НСИ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольНаСтраницу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКWebСервису</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмещениеВнешнейИБ</name>
    <type>
      <types>EnumRef.ВидыРазмещенияИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширенныйСпособИмпорта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаПодключения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипБД</name>
    <type>
      <types>CatalogRef.ТипыБазДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТабличногоДокумента</name>
    <type>
      <types>EnumRef.ТипыВнешнихТабличныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаПодключенияWebСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьФайлыПослеИмпорта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайловыйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьЭлементыНСИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХранилищаДанныхADO</name>
    <type>
      <types>EnumRef.ТипыХранилищДанныхADO</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляИмпортаЭталонныйКаталог</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭталонныйКаталог</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонвертироватьЗначенияВТекст</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтруктураИмени</name>
    <attributes>
      <name>НачалоЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>EnumRef.ТипыОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/БланкиОтчетов/БланкиОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БланкиОтчетов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ВидыОтчетов</owners>
  <attributes>
    <name>Макет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияПоУмолчанию</name>
    <type>
      <types>EnumRef.ПорядкиОкругленияОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньТочностиПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоУмолчаниюВВидеБланка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Утвержден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаскрытиеВМакете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксацияСлева</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФиксацияСверху</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БланкДляОтображения</name>
    <comment>Данный бланк используется только для отображения, так как не содержит всех ключевых реквизитов аналитик</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаШапки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаПодвала</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шапка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подвал</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаСтруктуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИерархияГруппировокСтрок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимСводнойТаблицы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ИерархияГруппировокКолонок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ракурс</name>
    <type>
      <types>CatalogRef.ОбластиДанныхВидовОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимБланка</name>
    <comment>0 - Однопериодный бланк, 1- Сводная таблица, 2 - Многопериодный бланк</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Мультиязычный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МакетРаскрытий</name>
    <comment>Содержит ТЧ частей макета для каждой группы раскрытия</comment>
    <attributes>
      <name>КодГруппыРаскрытия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>45</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Макет</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнаяЧасть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АдресаЭлементовСтруктурыОтчета</name>
    <attributes>
      <name>ТипЭлемента</name>
      <type>
        <types>EnumRef.ЭлементыСтруктурыОтчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>CatalogRef.СтрокиОтчетов</types>
        <types>CatalogRef.КолонкиОтчетов</types>
        <types>CatalogRef.ПоказателиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КолонкаНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресС1К1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеБланки</name>
    <attributes>
      <name>Бланк</name>
      <type>
        <types>CatalogRef.БланкиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦветЗакладки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КартинкаЗакладки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/DataProcessors/ГенерацияМоделиОтчетностиКИК/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Интерфейс

Процедура ОбновитьНастройкиМатрицы(Регламент) Экспорт

	КодСводныйРегистр = РасчетыПоКорпоративнымНалогам.ПолучитьКодСводныйРегистр();
	
	ГруппаКИК = РасчетыПоКорпоративнымНалогам.ПолучитьГруппуВидовОтчетаКИК();
	ДокНО = Справочники.ДокументыБД.НайтиПоНаименованию("НастраиваемыйОтчет", Истина,, Справочники.ТипыБазДанных.ТекущаяИБ);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	т.Ссылка
	|ИЗ
	|	Справочник.ВнешниеИнформационныеБазы КАК т
	|ГДЕ
	|	т.ТипБД = ЗНАЧЕНИЕ(Справочник.ТипыБазДанных.ОбменТаблДок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	т.Код ВОЗР");
	
	//вибТабДок = Запрос.Выполнить();
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ОбщегоНазначенияУХ.СообщитьОбОшибке("Не создано ни одной внешней информационной базы с типом загрузки из Excel");
		Возврат;
	КонецЕсли;
	вибТабДок = Результат.Выгрузить().Получить(0).Ссылка;
	
	ТабОрганизации = Регламент.ОрганизационныеЕдиницы.ВыгрузитьКолонку("ОрганизационнаяЕдиница");
	
	ШаблонЗаписи = Новый Структура("Активность, ДокументБД, ВерсияОрганизационнойСтруктуры", Истина, ДокНО, Регламент);
			
	ВыборкаВО = Справочники.ВидыОтчетов.Выбрать(ГруппаКИК);
	Пока ВыборкаВО.Следующий() Цикл
		
		ШаблонЗаписи.Вставить("ШаблонДокументаБД", ВыборкаВО.Ссылка);
		
		СпособФормирования = ?(СокрЛП(ВыборкаВО.Код) = КодСводныйРегистр, 
									Перечисления.СпособыФормированияОтчетов.АвтоматическиПоПравилуОбработки, 
									Перечисления.СпособыФормированияОтчетов.Импорт);
									
		БланкиДляОрганизаций = ПолучитьПоказателиИБланки(ВыборкаВО.Ссылка, Ложь);
									
		Для каждого ТекОрганизация Из ТабОрганизации Цикл			
			
			ШаблонЗаписи.Вставить("Организация", ТекОрганизация);
			
			ВыборкаНОбр = РегистрыСведений.НастройкаОбработкиОтчетов.Выбрать(Новый Структура("ШаблонДокументаБД", ВыборкаВО.Ссылка));
			
			//ПравилоОбработки, ПравилоПроверки, БланкДляОтображения, БланкДляИмпорта,   
			Пока ВыборкаНОбр.Следующий() Цикл
				
				МенеджерЗаписи = РегистрыСведений.НастройкаОбработкиОтчетов.СоздатьМенеджерЗаписи();			
				ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ШаблонЗаписи);				
				МенеджерЗаписи.ЭлементНастройкиОтчета = ВыборкаНОбр.ЭлементНастройкиОтчета;
				
				Если (ВыборкаНОбр.ЭлементНастройкиОтчета <> Перечисления.ЭлементыНастройкиОтчета.БланкДляОтображения) 
					И (ВыборкаНОбр.ЭлементНастройкиОтчета <> Перечисления.ЭлементыНастройкиОтчета.БланкДляИмпорта) Тогда
					
					МенеджерЗаписи.ЗначениеЭлементаНастройкиОтчета = ВыборкаНОбр.ЗначениеЭлементаНастройкиОтчета;
					
				ИначеЕсли ЗначениеЗаполнено(БланкиДляОрганизаций.БланкНК) 
					И (ТекОрганизация.ПорядокОпределенияПрибыли = Перечисления.ВидыПорядокаОпределенияПрибыли.ПоПравилам25ГлавыНК) Тогда
					
					МенеджерЗаписи.ЗначениеЭлементаНастройкиОтчета = БланкиДляОрганизаций.БланкНК;
					
				Иначе 
					
					МенеджерЗаписи.ЗначениеЭлементаНастройкиОтчета = БланкиДляОрганизаций.БланкФО;
					
				КонецЕсли;
				
				МенеджерЗаписи.Записать(Истина);
			
			КонецЦикла;
			
			//СпособФормированияОтчета
			МенеджерЗаписи = РегистрыСведений.НастройкаОбработкиОтчетов.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ШаблонЗаписи);
			МенеджерЗаписи.ЭлементНастройкиОтчета          = Перечисления.ЭлементыНастройкиОтчета.СпособФормированияОтчета;
			МенеджерЗаписи.ЗначениеЭлементаНастройкиОтчета = СпособФормирования;
			МенеджерЗаписи.Записать(Истина);
			
			//ВнешняяИнформационнаяБаза
			Если СпособФормирования = Перечисления.СпособыФормированияОтчетов.Импорт Тогда
			
				МенеджерЗаписи = РегистрыСведений.НастройкаОбработкиОтчетов.СоздатьМенеджерЗаписи();			
				МенеджерЗаписи.ЭлементНастройкиОтчета = Перечисления.ЭлементыНастройкиОтчета.ВнешняяИнформационнаяБаза;
				МенеджерЗаписи.ЗначениеЭлементаНастройкиОтчета = вибТабДок;
				МенеджерЗаписи.Записать(Истина);
			
			КонецЕсли;
			
		КонецЦикла;	
	КонецЦикла;

КонецПроцедуры

#КонецОбласти	

#Область ВспомогательныеПроцедурыФункции

Функция ПолучитьПоказателиИБланки(ВидОтчета, ОбновитьБланки = Ложь) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПоказателиОтчетов.Строка.Код КАК КодСтроки,
	|	ПоказателиОтчетов.ТипЗначения = ЗНАЧЕНИЕ(Перечисление.ТипыЗначенийПоказателейОтчетов.Число)
	|		И ПоказателиОтчетов.НеФинансовый КАК Нефинансовый,
	|	ПоказателиОтчетов.Строка.ЭлементСправочникаБД.ИспользуетсяФО КАК ИспользуетсяФО,
	|	ПоказателиОтчетов.Строка.ЭлементСправочникаБД.ИспользуетсяНК КАК ИспользуетсяНК
	|ИЗ
	|	Справочник.ПоказателиОтчетов КАК ПоказателиОтчетов
	|ГДЕ
	|	ПоказателиОтчетов.Владелец = &ВидОтчета
	|	И НЕ ПоказателиОтчетов.ПометкаУдаления
	|	И (ПоказателиОтчетов.ТипЗначения = ЗНАЧЕНИЕ(Перечисление.ТипыЗначенийПоказателейОтчетов.Число)
	|				И ПоказателиОтчетов.НеФинансовый
	|			ИЛИ НЕ ПоказателиОтчетов.Строка.ЭлементСправочникаБД.ИспользуетсяФО
	|			ИЛИ НЕ ПоказателиОтчетов.Строка.ЭлементСправочникаБД.ИспользуетсяНК)");
	
	Запрос.УстановитьПараметр("ВидОтчета", ВидОтчета);	
	ТабПоказатели = Запрос.Выполнить().Выгрузить();
	
	ТребуетсяБланкНК = ТабПоказатели.Найти(Ложь, "ИспользуетсяНК") <> Неопределено;
	
	БланкФО = Неопределено;
	БланкНК = Неопределено;
	
	БланкиДляОчистки = Новый Массив;
	
	Выборка = Справочники.БланкиОтчетов.Выбрать(, ВидОтчета);	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ПометкаУдаления Или Выборка.РежимБланка = 1 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОбновитьБланки Тогда
			УправлениеОтчетамиУХ.ОбновитьБланкОтчета(ВидОтчета, Выборка.Ссылка);	
		КонецЕсли;		
		
		Если БланкФО = Неопределено Тогда			
			БланкФО = Выборка.Ссылка;
		ИначеЕсли ТребуетсяБланкНК И (БланкНК = Неопределено) Тогда
			БланкНК = Выборка.Ссылка;
		ИначеЕсли СокрЛП(Выборка.Описание) <> "" Тогда			
			БланкиДляОчистки.Добавить(Выборка.Ссылка);			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат	Новый Структура("БланкФО,БланкНК,БланкиДляОчистки, ТабПоказатели,ТребуетсяБланкНК", 
							БланкФО, БланкНК, БланкиДляОчистки, ТабПоказатели, ТребуетсяБланкНК);

КонецФункции 

#КонецОбласти

#Область ОбновлениеОперандов

Процедура СообщитьОбОшибке(ТекстОшибки, ЛогОшибок = Неопределено)

	Если ЛогОшибок = Неопределено Тогда
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстОшибки);
	Иначе
		ЛогОшибок = ЛогОшибок + Символы.ПС + ТекстОшибки;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
